package com.company.lesson9.lesson9Task1_2;

/**
 * Заполнить табличку.
 * Создать классы для заполнения таблицы.
 */
public class Lesson9Task1_2 {

    public static void main(String[] args) {

        System.out.println("    |                                                             | private | default | protected | public");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");
        System.out.println("1   |  Один и тот же класс                                        |    +    |    +    |     +     |    +   ");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");
        System.out.println("2   |  Подкласс, находящийся в том же пакете, что и суперкласс    |    -    |    +    |     +     |    +   ");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");
        System.out.println("3   |  Класс из того же самого пакета, не являющийся подклассом.  |    -    |    +    |     +     |    +    ");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");
        System.out.println("4   |  Подкласс, находящийся в другом пакете.                     |    -    |    -    |     +     |    +   ");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");
        System.out.println("5   |  Класс из другого пакета, не являющийся подклассом данного  |    -    |    -    |     -     |    +   ");
        System.out.println("____|_____________________________________________________________|_________|_________|___________|________");


    }
}
